# Как жить с этой болью?
## Преамбула
Для VLAN нужна конфигурация называемая ~~говно на палочке~~ router on a stick. В чем соль: один физический интерфейс разделяется несколькими логическими для маршрутизации между различными виртуальными сетями.
## Базовые настройки

Для начала необходмо зайти в терминал устройства (например, роутера) и перейти в привелигированный режим:
```
Router>endable
```
В привелигированном режиме перейти в режим конфигуарции:
```
Router#configure terminal
```

## Роутер
### Как сделать ...
#### ... IP адрес
Для начала необходимо выбрать интерфейс виртуальной локальной подсети по умолчанию:
```
Router(config)#interface vlan 1
```
После чего настроить IP адрес и маску подсети можно следующей командой:
```
Router(config-if)#ip address 192.18.1.1 255.255.255.0
```
#### ... router on a stick
Переходим к логическому интерфейсу (номер после точки) на физическом (fastEthernet0/0):
```
Router(config)#interface fastEthernet0/0.7
```
Устанавливаем протокол транкинга и номер VLAN'а этого виртуального интерфейса:
```
Router(config-subif)#encapsulation dot1Q 7
```
И задаем IP адрес маршрутизатора для этого VLAN'а:
```
Router(config-subif)#ip address 192.168.7.1 255.255.255.0
```
Именно этот адрес будет адресом default gateway для конечных устройств в этом VLAN'е.

Наконец необходимо не забыть включить порт:
```
Router(config-subif)#no shutdown 
```

Эти действия необходимо произвести для каждого VLAN'a.

## Коммутатор (switch)
### Как сделать ...
#### ... VLAN
В привелигированном режиме конфигурации VLAN с номером 10 создается командой:
```
Switch(config)#vlan 10
```
VLAN с номером 1 является VLAN по умолчанию.

После этого можно дать VLAN'у имя, например managment:
```
Switch(config-vlan)#name managment
```
#### ... Trunc порт
Trunc порт позволяет по одному физическому каналу между коммутатором и другим сетевым устройством, приходящему в этот порт, передавать трафик разных VLAN.

Для создания переходим к интерфейсу на котором хотим установить режим trunc:
```
Switch(config)#interface fastEthernet0/3
```
И устанавливаем непосредственно режим trunc:
```
Switch(config-if)#switchport mode trunk 
```
Указываем какие VLAN пропускать:
```
Switch(config-if)#switchport trunk allowed vlan 7,10
```
## Компьютер
### Как сделать ...

#### ... IP адрес
Настроить IP адрес и маску подсети можно в командной строке следующей командой:
```
C:\>ipconfig 192.168.1.10 255.255.255.0
```
#### ... Default Gateway
Адрес маршрутизатора. Нужен компьютеру если хотим постучаться в другую сеть, о которой ничего не знаем. Задается третьим параметром в команде:
```
C:\>ipconfig 192.168.1.10 255.255.255.0 192.168.1.1
`````

# Необходимый уровень боли (настройка telnet)
## Что делать
### На коммутаторе
У коммутатора IP мы не задавали, поэтому придется задать, причем в той же сети (пусть и виртуальной), в которой компьютер, с которого хотим стучаться. Для этого перейдем в интерфейс сети:
```
Switch(config)#interface vlan 7
```
И зададим собственно IP:
```
Switch(config-if)#ip address 192.168.7.100 255.255.255.0
``` 
После чего  выйдем из конфигурации интерфейса, и введем команду:
```
Switch(config)#aaa new-model
```
Теперь можно создать пользователя (admin) с паролем (admin):
```
Switch(config)#username admin secret admin
```
Необходимо так же задать пароль (admin) для доступа к привелигированному режиму:
```
Switch(config)#enable secret admin
```
### На роутере
Так как на роутере IP адреса уже заданы, необходимо только воспроизвести шаги создания пользователей и задания паролей.

### На компьютере
Чтобы постучать на компьютере (стучаться для примера будем к коммутатору), введем в Command Prompt:
```
C:\>telnet 192.168.7.100
```
Необходимо ввести заданые логин и пароль, после чего будет открыт удаленный доступ к коммутатору
# Стокгольмский синдром боли (здесь когда-нибудь возможно появится настройка ssh)